[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  //if (n === 0 || n === 1) return 1; REMOVIDA POIS A LOGICA NAO FARA DIFERENÇA E IMPEDIRA QUE OS SEUS MUTANTES SOBREVIVAM
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 8. deve calcular o fatorial e limites de lógica
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] BlockStatement
src/operacoes.js:83:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  //if (numeros.length === 0) return 1; REMOVIDA POIS NAO AFETARA O FUNCIONAMENTO E IMPEDIRA QUE OS SEUS MUTANTES SOBREVIVAM
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   return Math.min(Math.max(valor, min), max);
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 35. deve calcular o produto de um array, inclusive vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArrowFunction
src/operacoes.js:85:25
 }
 function produtoArray(numeros) {
   //if (numeros.length === 0) return 1; REMOVIDA POIS NAO AFETARA O FUNCIONAMENTO E IMPEDIRA QUE OS SEUS MUTANTES SOBREVIVAM
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce(() => undefined, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 35. deve calcular o produto de um array, inclusive vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:85:39
 }
 function produtoArray(numeros) {
   //if (numeros.length === 0) return 1; REMOVIDA POIS NAO AFETARA O FUNCIONAMENTO E IMPEDIRA QUE OS SEUS MUTANTES SOBREVIVAM
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce((acc, val) => acc / val, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 35. deve calcular o produto de um array, inclusive vazio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] BlockStatement
src/operacoes.js:87:33
   //if (numeros.length === 0) return 1; REMOVIDA POIS NAO AFETARA O FUNCIONAMENTO E IMPEDIRA QUE OS SEUS MUTANTES SOBREVIVAM
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  return Math.min(Math.max(valor, min), max);
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 36. deve testar todos os limites do clamp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] MethodExpression
src/operacoes.js:88:19
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  return Math.min(Math.max(valor, min), max);
+  return Math.min(Math.min(valor, min), max);
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 36. deve testar todos os limites do clamp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] MethodExpression
src/operacoes.js:88:10
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  return Math.min(Math.max(valor, min), max);
+  return Math.max(Math.max(valor, min), max);
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
killedBy: Suíte de Testes Forte para 50 Operações Aritméticas 36. deve testar todos os limites do clamp
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10
